app/forms/session_request.rb

  def authenticate
    return nil unless valid?
    user = User.find_by_email(email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "one@one.com"], ["LIMIT", 1]]