app/controllers/cards_controller.rb

SELECT "cards".* FROM "cards"
---
  def index
    @cards = Card.all