app/controllers/decks_controller.rb

  def index
    @decks = Deck.where(user_id: params[:user_id]).all
---
SELECT "decks".* FROM "decks" WHERE "decks"."user_id" = ? AND "decks"."id" IS NULL  [["user_id", 4]]

  def show
    @deck = Deck.where(user_id: params[:user_id], id: params[:id]).first
---
SELECT "decks".* FROM "decks" WHERE "decks"."user_id" = ? AND "decks"."id" = ? ORDER BY "decks"."id" ASC LIMIT ?  [["user_id", 4], ["id", 2], ["LIMIT", 1]]

    def set_deck
      @deck = Deck.find(params[:id])
---
SELECT "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]