app/controllers/decks_controller.rb

  def index
    @decks = Deck.all
---
SELECT "decks".* FROM "decks"